#include <unistd.h>
#include <stdio.h>
#include <string.h>

//🌑🌒🌓🌔🌕🌖🌗🌘
//╱╲╳
int main() {
    // printf("\n%s\n\n","╳");
    printf("[_0]-[_1]-[_1]\n    ╳ |\n[_2] [_3] [_3]\n\n[_2] [_3] [_3]");

    // 선 배열길이 (w-1)*w + (w+w-1)*(w-1)

    // 선 접근 (칸 위치 n)

    // 오른쪽 = (n/w)*(w+w-1+w-1)+(n-(w*(n/w))) = (n/w)*(w*2-2)+n
    //  (n/w)(3w-2)+(n-w(n/w))
    // (n/w)(3w-2)
    // (n/w)*(w*3-2) - w*(n/w) + n
    // (n/w)*(w*2-2)+n

    // 왼쪽 = (n/w)*(w+w-1+w-1)+(n-(w*(n/w))-1) = (n/w)*(w*2-2)+n-1

    // 위쪽 = (n/w)*(w+w-1+w-1)-((w-(n-(w*(n/w))))*2-1) = (n/w)*(w*3-2)-(w*(n/w+1)-n)*2+1
    // (n/w)*(w*3-2) - (w-(n-(w*(n/w))))*2 + 1
    // (n/w)*(w*3-2) - (w+w*(n/w)-n)*2 +1
    // w+w*(n/w) = w*(n/w+1)
    // (n/w)*(w*3-2) - (w*(n/w+1)-n)*2 +1

    // 아래쪽 = ((n+w)/w)*(w+w-1+w-1)-((w-(n-(w*(n/w))))*2-1) = (n+w)/w*(w*3-2)-(w*(n/w+1)-n)*2+1
    // (n+w)/w*(w*3-2)-(w*(n/w+1)-n)*2+1

    // 좌상 = (n/w)*(w+w-1+w-1)-((w-(n-(w*(n/w))))*2-1)-1 = (n/w)*(w*3-2)-(w*(n/w+1)-n)*2

    // 우상 = (n/w)*(w+w-1+w-1)-((w-(n-(w*(n/w))))*2-1)+1 = (n/w)*(w*3-2)-(w*(n/w+1)-n)*2+2

    // 좌하 = ((n+w)/w)*(w+w-1+w-1)-((w-(n-(w*(n/w))))*2-1)-1 = (n+w)/w*(w*3-2)-(w*(n/w+1)-n)*2

    // 우하 = ((n+w)/w)*(w+w-1+w-1)-((w-(n-(w*(n/w))))*2-1)+1 = (n+w)/w*(w*3-2)-(w*(n/w+1)-n)*2+2


    // -w-1 -w 1-w
    // -1 0 1
    // w-1 w w+1

    int n =4;
    int w=3;
    printf("\n%d",n-w);

    int linkers[(w-1)*w+(w+w-1)*(w-1)+1];
    memset(linkers, 0, sizeof(linkers));
    printf("\n\n%03d",1);

for (int i = 0; i < w; i++)
        for (int j = 0; j < w; j++)
        printf("\n->%d",i*w+j);
    // n-(w*(n/w)) 현재줄의 몇번쨰인지
    // 1이면 1, 2면 3, 3이면 5
}